# RasterQuality Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..RasterQuality Property
PDFExportOptions Class See Also
---
The preferred raster quality (DPI).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public RasterQualityType RasterQuality { get; set; }
```

Visual Basic
---
```text
Public Property RasterQuality As RasterQualityType
	Get
	Set
```

Visual C++
---
```text
public:
property RasterQualityType RasterQuality {
	RasterQualityType get ();
	void set (RasterQualityType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace